[
    {
        "title": "Building a Design System for an edTech Platform",
        "blurb": "Working with a small team of designers at Combine Venture Builders, I built a scalable design system for Brightspot, a brand-new edTech app.",
        "slug": "brightspot_design_system",
        "coverImage": {
            "url": "/assets/images/portfolio/ds-cover.png",
            "alt": "Brightspot Design System"
        },
        "content": [
            {
                "blockType": "markdown",
                "content": "The challenge for this project was to build a design system that was easy to maintain and implement, flexible for future updates and one that speeds up the design and development of Brightspot."
            },
            {
                "blockType": "markdown",
                "content": "We started by using research and experimentation to drive the design decisions and develop the visual language for Brightspot. Once aligned on the visual language, we outlined a design principle and guideline to inform our design choices. One of the principles included that our user interface was conversational, playful & gamified. From there, all we had to do, was build patterns, flows, and components, that aligned with our principle & guideline."
            },
            {
                "blockType": "image",
                "url": "/assets/images/portfolio/ds-process.png",
                "alt": "Brightspot Design System Process"
            },
            {
                "blockType": "markdown",
                "content": "The result was a highly flexible design system that helped speed up the design and development process at Brightspot. It significantly increased the productivity of our design team & gave us more time to work on solutions, as opposed to building user interfaces from the ground up. It also enabled the engineering team to shorten their turnaround time on building features, as they had a library of UI components and patterns they could plug and play."
            },
            {
                "blockType": "image",
                "url": "/assets/images/portfolio/ds-result.png",
                "alt": "Brightspot Design System Result"
            },
            {
                "blockType": "image",
                "url": "/assets/images/portfolio/ds-result-2.png",
                "alt": "Brightspot Design System Result Application"
            },
            {
                "blockType": "markdown",
                "content": "The development of the design guideline, reusable components library & standard pattern and flow enabled us to move faster and engage with partners with consistent visual language, allowing us to communicate Brightspot's value proposition."
            }
        ]
    },
    {
        "title": "Brightspot: Designing a Complex Personal and Professional Development App",
        "blurb": "I had a substantial role in designing Brightspot, a brand-new ed-tech platform working with a small team of designers at Combine Venture Builders. Brightspot is a development platform that enables organizations to deliver in-house content to their team and individuals to grow personally and professionally with original learning content from influential content creators and thought leaders.",
        "slug": "brightspot_app_design",
        "coverImage": {
            "url": "/assets/images/portfolio/bs-cover.png",
            "alt": "Brightspot app design"
        },
        "content": [
            {
            "blockType": "markdown",
            "content": "Brightspot offers bite-sized learning without sacrificing quality, and our designs are required to enable that. And that's only possible if the interface & flow are intuitive and easy to navigate. We wanted to keep the users engaged & focused while on Brightspot with an interface design that compliments the content and does not overshadow it."
            },
            {
            "blockType": "markdown",
            "content": "I joined the Brightspot team in the early exploration phase, which allowed me to contribute at all stages of the app. We started with wireframing layouts and exploring flows before jumping into high-fidelity designs. The early design exploration followed the research the team conducted. Following that, we created a few low-fidelity screens to help us identify the visual aesthetic aligned with our design guidelines and principles (see design system case study)."
            },
            {
                "blockType": "image",
                "url": "/assets/images/portfolio/bs-process.png",
                "alt": "Brightspot app design process"
            },
            {
                "blockType": "markdown",
                "content": "At Brightspot, we worked in two-week sprints. We took on a couple of design projects per sprint, which allowed us to focus on specific screens, user interfaces, and flow designs. During those sprints, we transformed wireframes into high-fidelity development-ready designs. The design process, from the wireframe to the finished design, involved multiple review cycles with the Head of Design, Product Owner & Engineering team members. Those reviews provided valuable feedback that improved the user and developer experience."
            },
            {
            "blockType": "markdown",
            "content": "Our designs gave the engineering team clear directions when building the app. Launching to private beta in August 2022 and receiving positive feedback from users and stakeholders, Brightspot closed a fundraising round with a $15M valuation. I believe the cohesive brand and elegant designs of the app were one of the contributors to the success of Brightspot."
            },
            {
                "blockType": "image",
                "url": "/assets/images/portfolio/bs-result.png",
                "alt": "Brightspot app design result"
            },
            {
            "blockType": "markdown",
            "content": "Creating a brand-new app from vision to launch with a small team dedicated to their craft was a wonderful experience. I'm so glad I got to work with such a team that allowed me to be creative, challenge the status quo and deliver impactful work."
            }
        ]
    },
    {
        "title": "Creating Animated Product Demo Video for an ESG Accounting Platform",
        "blurb": "As a product designer at Combine Venture Builders with an experience in motion graphics and animation, I was tasked to create a demo video showcasing features and use cases of Agora, an ESG accounting SaaS product we built with Agora Labs.",
        "slug": "agora_product_demo",
        "coverImage": {
            "url": "/assets/images/portfolio/al-product-demo-cover2.gif",
            "alt": "Agora Product Demo Video"
        },
        "content": [
            {
            "blockType": "markdown",
            "content": "The primary goal was to create a product demo video that effectively communicated the features and benefits of Agoras' potential customers while being visually appealing and remaining informative and easy to follow."
            },
            {
                "blockType": "image",
                "url": "/assets/images/portfolio/al-product-demo-dashboard.gif",
                "alt": "Agora Product Demo Dashboard Reveal"
            },
            {
            "blockType": "markdown",
            "content": "To start the project, we analyzed the current dashboard to identify areas that required improvement to enhance the user experience. The redesign was done in Figma and moved designs to Framer and After Effects for animation purposes."
            },
            {
                "blockType": "image",
                "url": "/assets/images/portfolio/al-product_demo_exploration.gif",
                "alt": "Agora Product Demo Visual Exploration"
            },
            {
                "blockType":"markdown",
                "content":"The result is a high-quality product demo video that effectively communicates the benefits of Agora Labs' ESG accounting SaaS to potential customers. The video is engaging, visually appealing, and easy to follow, making it an effective tool for driving customer acquisition and increasing brand awareness."
            },
            {
                "blockType": "video",
                "url": "/assets/videos/agora_product_demo.mp4",
                "poster": "/assets/videos/agora_product_demo_poster.jpg"
            }
        ]
    },
    {
        "title":"Building a Prototype to Showcase Brightspot to Partners and Investors",
        "blurb":"I designed and built a highly interactive prototype using Framer that communicated Brightspot's vision to partners, investors and other stakeholders.",
        "slug":"brightspot_prototype",
        "coverImage":{
            "url": "/assets/images/portfolio/bs-prototype-cover.png",
            "alt": "Brightspot app design"
        },
        "content":[
            {
                "blockType":"markdown",
                "content":"The initial explorations focused on identifying fitting design solutions for transitioning between different screens and interactions within the app. I used Figma, Framer, and custom React code to develop a prototype that showcased the functionalities and how they worked in practice. The prototype was then presented to stakeholders and users to gather feedback."
            },
            {
                "blockType":"markdown",
                "content":"Incorporating feedback was an iterative process, where I worked closely with stakeholders and users to ensure that their feedback was incorporated into the design and build."
            },
            {
                "blockType":"layout",
                "content": [
                    {
                        "blockType": "video",
                        "url": "/assets/videos/prototype_video_loading.mp4",
                        "poster": "/assets/videos/",
                        "controls":{
                            "autoplay": true,
                            "loop": true
                        }
                    },
                    {
                        "blockType": "video",
                        "url": "/assets/videos/prototype_video_communities.mp4",
                        "poster": "/assets/videos/",
                        "controls":{
                            "autoplay": true,
                            "loop": true
                        }
                    }
                ]
            },
            {
                "blockType":"markdown",
                "content":"The final result was a visually stunning prototype that showcased Brightspot's innovative features and potential. It was used in partnership talks and fundraising pitches, allowing potential partners and investors to see firsthand what the app could do and how it could benefit their organizations."
            },
            {
                "blockType":"layout",
                "content": [
                    {
                        "blockType": "video",
                        "url": "/assets/videos/prototype_video_plan_flow.mp4",
                        "poster": "/assets/videos/",
                        "controls":{
                            "autoplay": true,
                            "loop": true
                        }
                    },
                    {
                        "blockType": "video",
                        "url": "/assets/videos/bs_prototype_badges.mp4",
                        "poster": "/assets/videos/",
                        "controls":{
                            "autoplay": true,
                            "loop": true
                        }
                    }
                ]
            }
        ]
    }
]